-- Вставка университетов
INSERT INTO UNIVERSITY (Univ_name, Rating, City)
VALUES ('Университет 1', 4.5, 'Город1'),
       ('Университет 2', 3.8, 'Город2'),
       ('Университет 3', 4.2, 'Город3');

-- Вставка студентов
INSERT INTO Students (Surname, Name, Stipend, Kurs, City, Birhday, Univ_id)
VALUES ('Иванов', 'Иван', 150, 1, 'Город1', '1995-05-15', 1),
       ('Петров', 'Петр', 160, 2, 'Город2', '1994-08-22', 2),
       ('Сидоров', 'Сидор', 140, 3, 'Город3', '1996-02-10', 3);

-- Вставка преподавателей
INSERT INTO LECTURER (Surname, Name, City, Univ_id)
VALUES ('Преподаватель1', 'Имя1', 'Город1', 1),
       ('Преподаватель2', 'Имя2', 'Город2', 2),
       ('Преподаватель3', 'Имя3', 'Город3', 3);

-- Вставка предметов
INSERT INTO SUBJECT (Subj_name, Hour, Semester)
VALUES ('Предмет1', 36, 1),
       ('Предмет2', 45, 2),
       ('Предмет3', 30, 1);

-- Вставка оценок на экзаменах
INSERT INTO EXAM_MARKS (Student_id, Subj_id, Mark, Exam_date)
VALUES (1, 1, 8, '2023-01-10'),
       (1, 2, 8, '2023-02-15'),
       (2, 1, 9, '2023-03-20'),
       (2, 3, 7, '2023-04-25'),
       (3, 2, 8, '2023-05-30'),
       (3, 1, 5, '2023-05-30');

-- Вставка связей между предметами и преподавателями
INSERT INTO SUBJ_LECT (Subj_id)
VALUES (1),
       (2),
       (3);
